In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
animals = DataFrame(np.arange(16).reshape((4,4)),
                columns=['W','X','Y','Z'],
                   index=['dog','cat','bird','mouse'])

In [3]:
animals

        W   X   Y   Z
dog     0   1   2   3
cat     4   5   6   7
bird    8   9  10  11
mouse  12  13  14  15

In [5]:
animals.loc[1:2,['W','Y']] = np.nan

In [6]:
animals

          W   X     Y   Z
dog     0.0   1   2.0   3
cat     NaN   5   NaN   7
bird    8.0   9  10.0  11
mouse  12.0  13  14.0  15

In [7]:
behavior_map = {'W':'bad','X':'good','Y':'bad','Z':'good'}

In [13]:
animals_col = animals.groupby(behavior_map,axis=1)

In [11]:
animals_col = animals.groupby(behavior_map,axis=0)

In [14]:
animals_col.sum()

        bad  good
dog     2.0   4.0
cat     0.0  12.0
bird   18.0  20.0
mouse  26.0  28.0

In [15]:
ser1  = Series(behavior_map)

In [16]:
ser1

W     bad
X    good
Y     bad
Z    good
dtype: object

In [17]:
animals.groupby(behavior_map,axis=1).count()

       bad  good
dog      2     2
cat      0     2
bird     2     2
mouse    2     2

In [18]:
animals

          W   X     Y   Z
dog     0.0   1   2.0   3
cat     NaN   5   NaN   7
bird    8.0   9  10.0  11
mouse  12.0  13  14.0  15

In [19]:
animals.groupby(len).sum()

# index の文字列の長さでグルーピング

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [20]:
keys = ['A','B','A','B']

In [21]:
animals.groupby([len,keys]).max()

# 関数とリストで与えた

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15